<?php

namespace concepture\yii2logic\helpers;

class Transliterator
{


    static $lang2tr = array(
        // russian
        'й'=>'y','ц'=>'ch',
        'у'=>'u','к'=>'k',
        'е'=>'e','н'=>'n',
        'г'=>'g','ш'=>'sh',
        'щ'=>'shsh','з'=>'z',
        'х'=>'h','ъ'=>'',
        'ф'=>'f','ы'=>'y',
        'в'=>'v','а'=>'a',
        'п'=>'p','р'=>'r',
        'о'=>'o','л'=>'l',
        'д'=>'d','ж'=>'zh',
        'э'=>'e','я'=>'ya',
        'ч'=>'ch','с'=>'s',
        'м'=>'m','и'=>'i',
        'т'=>'t','ь'=>'',
        'б'=>'b','ю'=>'yu',
        'ё'=>'e','и'=>'i',
        'Й'=>'Y','Ц'=>'CH',
        'У'=>'U','К'=>'K',
        'Е'=>'E','Н'=>'N',
        'Г'=>'G','Ш'=>'SH',
        'Щ'=>'SHSH','З'=>'Z',
        'Х'=>'H','Ъ'=>'',
        'Ф'=>'F','Ы'=>'Y',
        'В'=>'V','А'=>'A',
        'П'=>'P','Р'=>'R',
        'О'=>'O','Л'=>'L',
        'Д'=>'D','Ж'=>'ZH',
        'Э'=>'E','Я'=>'YA',
        'Ч'=>'CH','С'=>'S',
        'М'=>'M','И'=>'I',
        'Т'=>'T','Ь'=>'',
        'Б'=>'B','Ю'=>'YU',
        'Ё'=>'E','И'=>'I',
        // czech
        'á'=>'a', 'ä'=>'a', 'ć'=>'c', 'č'=>'c', 'ď'=>'d', 'é'=>'e', 'ě'=>'e',
        'ë'=>'e', 'í'=>'i', 'ň'=>'n', 'ń'=>'n', 'ó'=>'o', 'ö'=>'o', 'ŕ'=>'r',
        'ř'=>'r', 'š'=>'s', 'Š'=>'S', 'ť'=>'t', 'ú'=>'u', 'ů'=>'u', 'ü'=>'u',
        'ý'=>'y', 'ź'=>'z', 'ž'=>'z',
        'і'=>'i', 'ї' => 'i', 'b' => 'b', 'І' => 'i',
        // special
        ' '=>'-', '_' => '-' ,
        '\''=>'', '"'=>'',
        '\t'=>'', '«'=>'',
        '»'=>'', '?'=>'',
        '!'=>'', '*'=>'',
        '+'=>'plus' , '№' => 'number',
        '`'=> '' , '?' => ''
    );

    static $other_langs =  [
//        'ru' => [
//            ['А','Б','В','Г','Д','Е','З','И','Й','К','Л','М','Н','О','П','Р',
//            'С','Т','У','Ф','Х','Ы','Э','а','б','в','г','д','е','з','и','й',
//            'к','л','м','н','о','п','р','с','т','у','ф','х','ы','э',
//            'ё','ж','ц','ч','ш','щ','ю','я','Ё','Ж','Ц','Ч','Ш','Щ','Ю','Я',
//            'Ъ','Ь','ъ','ь'],
//            ['A','B','V','G','D','E','Z','I','J','K','L','M','N','O','P','R',
//            'S','T','U','F','H','I','E','a','b','v','g','d','e','z','i','j',
//            'k','l','m','n','o','p','r','s','t','u','f','h','i','e',
//            'yo','zh','tc','ch','sh','sh','yu','ya','YO','ZH','TC','CH','SH','SH','YU','YA',
//            '','','','']
//        ],
        'ro' => [
            ['A','Ă','Â','B','C','D','E','F','G','H',
                'I','Î','J','K','L','M','N','O','P','Q',
                'R','S','Ș','T','Ț','U','V','W','X','Y',
                'Z','a','ă','â','b','c','d','e','f','g',
                'h','i','î','j','k','l','m','n','o','p',
                'q','r','s','ș','t','ț','u','v','w','x',
                'y','z'],
            ['A','A','A','B','C','D','E','F','G','H',
                'I','I','J','K','L','M','N','O','P','Q',
                'R','S','S','T','T','U','V','W','X','Y',
                'Z','a','a','a','b','c','d','e','f','g',
                'h','i','i','j','k','l','m','n','o','p',
                'q','r','s','s','t','t','u','v','w','x',
                'y','z']
        ],
        'es' => [
            ['A','Á','B','C','D','E','É','F','G','H',
                'I','Í','J','K','L','M','N','Ñ','O','Ó','P','Q',
                'R','S','T','U','Ú','Ü','V','W','X','Y',
                'Z','a','á','b','c','d','e','é','f','g',
                'h','i','î','í','j','k','l','m','n','ñ','o','ó','ó','p',
                'q','r','s','t','u','ü','ú','v','w','x',
                'y','z'],
            ['A','A','B','C','D','E','E','F','G','H',
                'I','I','J','K','L','M','N','N','O','O','P','Q',
                'R','S','T','U','U','U','V','W','X','Y',
                'Z','a','a','b','c','d','e','e','f','g',
                'h','i','i','i','j','k','l','m','n','n','o','o','o','p',
                'q','r','s','t','u','u','u','v','w','x',
                'y','z']
        ],
        'kk' => [
            ['А','Ә','Б','В','Г','Ғ','Д','Е','З','И','Й','К','Қ','Л','М','Н','Ң','О','Ө','П','Р',
                'С','Т','У','Ұ','Ү','Ф','Х','Һ','Ы','І','Э','а','ә','б','в','г','ғ','д','е','з','и','й',
                'к','қ','л','м','н','ң','о','ө','п','р','с','т','у','ұ','ү','ф','х','һ','ы','і','э',
                'ё','ж','ц','ч','ш','щ','ю','я','Ё','Ж','Ц','Ч','Ш','Щ','Ю','Я',
                'Ъ','Ь','ъ','ь'],
            ['A','A','B','V','G','G','D','E','Z','I','J','K','Q','L','M','N','N','O','О','P','R',
                'S','T','U','U','U','F','H','H','I','I','E','a','a','b','v','g','g','d','e','z','i','j',
                'k','q','l','m','n','n','o','о','p','r','s','t','u','u','u','f','h','h','i','i','e',
                'yo','zh','tc','ch','sh','sh','yu','ya','YO','ZH','TC','CH','SH','SH','YU','YA',
                '','','','']
        ],
        'gr' => [// upper case πιθανότητα πιθανότητα
            ['Α', 'Ά','Β','Γ','Δ','Ε','Έ','Ζ','Η','Ή','Θ','Ι','Ί','Ϊ','ΐ','Κ','Λ','Μ','Ν','Ξ',
                'Ο','Ό','Π','Ρ','Σ','Τ','Υ','Ύ','Ϋ','ΰ','Φ','Χ','Ψ','Ω','Ώ',
                'α','ά','β','γ','δ','ε','έ','ζ','η','ή','θ','ι','ί','ϊ','κ',
                'λ','μ','ν','ξ','ο','ό','π','ρ','σ','τ','υ','ύ','ϋ','φ','χ','ψ','ω','ώ'],
            ['A','A','V','G','D','E','E','Z','I','I','Th','I','I','I','i','K','L','M','N','X',
                'O','O','P','R','S','T','Y','Y','Y','y','F','Ch','Ps','O','O',
                'a','a','v','g','d','e','e','z','i','i','th','i','i','i','k','l','m','n',
                'x','o','o','p','r','s','t','y','y','y','f','ch','ps','o','o']
        ],
        'co' => [
            ['A','Á','B','C','D','E','É','F','G','H',
                'I','Í','J','K','L','M','N','Ñ','O','Ó','P','Q',
                'R','S','T','U','Ú','Ü','V','W','X','Y',
                'Z','a','á','b','c','d','e','é','f','g',
                'h','i','î','í','j','k','l','m','n','ñ','o','ó','ó','p',
                'q','r','s','t','u','ü','ú','v','w','x',
                'y','z'],
            ['A','A','B','C','D','E','E','F','G','H',
                'I','I','J','K','L','M','N','N','O','O','P','Q',
                'R','S','T','U','U','U','V','W','X','Y',
                'Z','a','a','b','c','d','e','e','f','g',
                'h','i','i','i','j','k','l','m','n','n','o','o','o','p',
                'q','r','s','t','u','u','u','v','w','x',
                'y','z']
        ],
        'mx' => [
            ['A','Á','B','C','D','E','É','F','G','H',
                'I','Í','J','K','L','M','N','Ñ','O','Ó','P','Q',
                'R','S','T','U','Ú','Ü','V','W','X','Y',
                'Z','a','á','b','c','d','e','é','f','g',
                'h','i','î','í','j','k','l','m','n','ñ','o','ó','ó','p',
                'q','r','s','t','u','ü','ú','v','w','x',
                'y','z'],
            ['A','A','B','C','D','E','E','F','G','H',
                'I','I','J','K','L','M','N','N','O','O','P','Q',
                'R','S','T','U','U','U','V','W','X','Y',
                'Z','a','a','b','c','d','e','e','f','g',
                'h','i','i','i','j','k','l','m','n','n','o','o','o','p',
                'q','r','s','t','u','u','u','v','w','x',
                'y','z']
        ],
    ];

    /**
     * Транслит строки
     *
     * @param string $string
     * @return string
     */
    public static function translit($string)
    {
        $array1 = self::$lang2tr;
        $array2 = self::$other_langs;
        foreach ($array2 as $arr){
            $array = array_combine($arr[0], $arr[1]);
            $array1 = array_merge($array1, $array) ;
        }

        $result = preg_replace( '/[\-]+/', '-', preg_replace( '/[^\w\-\*]/', '', strtolower( strtr( trim($string), $array1 ) ) ) );
        $result = self::utf8Normilize($result);

        return $result;
    }

    /**
     * Нормализация кодировки UTF-8
     *
     * @param string $string
     * @return string
     */
    public static function utf8Normilize($string)
    {
        $result =  mb_convert_encoding($string, 'UTF-8', 'UTF-8');
        #частный случай убирает знак вопроса после конвертации
        $result = str_replace('?', '', $result);

        return $result;
    }
}